Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/houses_of_the_oireachtas/dissolution_of_the_dail.html.txt.tmx
Source language: en
Languages: ga

source: The Irish Constitution (Bunreacht na hÉireann) states that the Dáil (one of the houses of Parliament) shall not continue for a period longer than 7 years
ga: Tá sé ráite sa Bhunreacht nár cheart a bheith de ré ag aon Dáil Éireann ach 7 mbliana

source: It also states that legislation can fix a shorter period for the duration of the Dáil
ga: Tá sé ráite chomh maith go bhféadfaí ré níos giorra ná sin a shocrú le reachtaíocht

source: Since 1927, the law states that the maximum period for the duration of the Dáil is 5 years
ga: Cuireadh uasmhéid 5 bliana ar ré na Dála faoi dlí a tháinig i bhfeidhm i 1927

source: This means that there must be a general election at least every 5 years
ga: Ciallaíonn sé seo go gcaithfear toghchán a reachtáil gach 5 bliana ar a laghad

source: There is no minimum period for the duration of the Dáil
ga: Níl íosmhéid ag baint le ré na Dála

source: The President of Ireland has the power to dissolve the Dáil so that a general election must be held
ga: Tá an ceart ag Uachtarán na hÉireann Dáil Éireann a lánscor sa chaoi is go gcaithfear olltoghchán a reachtáil

source: If the Taoiseach has the support of the majority of the members of the Dáil, and he or she advises the President to dissolve the Dáil, the President must do so
ga: Má tá tacaíocht tromlach na dTeachtaí Dála ag an Taoiseach agus má iarrann sé/sí ar an Uachtarán an Dáil a lánscor, ní foláir don Uachtarán é sin a dhéanamh

source: If the Taoiseach does not have the support of the majority of the members of the Dáil, the President may refuse to dissolve the Dáil
ga: Muna bhfuil tacaíocht tromlach na dTeachtaí Dála ag an Taoiseach, d'fhéadfadh an tUachtarán lánscor na Dála a dhiúltú

source: The Constitution states that once the President issues a proclamation dissolving the Dáil, a general election must be held within 30 days
ga: Tá sé ráite sa Bhunreacht go gcaithfear olltoghchán a bheith ann taobh istigh de 30 lá ón lá a eisíonn an tUachtáran fógra go bhfuil an Dáil le scoir

source: After the President issues the proclamation, the Clerk of the Dáil issues a writ to the returning officer in each constituency directing them to hold an election of the prescribed number of members
ga: Eisíonn Cléireach na Dála eascaire chuig an gceann comhairimh i ngach dáilcheantar á threorú nó á treorú toghchán den líon forordaithe comhaltaí a reáchtáil

source: The Minister for Housing, Planning and Local Government appoints the polling day which must be between the 18th and 25th day (excluding Good Friday, Sundays and public holidays) after the issue of the writ
ga: Ceapann an tAire Tithíochta, Pleanála, Pobal agus Rialtais Áitiúil an lá vótaíochta nach mór a reáchtáil idir an 18ú agus an 25ú lá tar éis aon eascaire a eisiúint (ní bhíonn Aoine an Chéasta, Domhnaí agus Saoirí Poiblí san áireamh)

source: The Minister also appoints the polling period which must consist of at least 12 hours between 7am and 10.30pm
ga: Ceapann an tAire an tréimhse vótaíochta freisin a mhairfidh ar feadh 12 uair an chloig ar a laghad idir 7rn. agus 10.30in
